[net]
batch=64
subdivisions=8
width=320
height=320
channels=3
momentum=0.949
decay=0.0005
angle=0
saturation=1.5
exposure=1.5
hue=.1


learning_rate=0.001
burn_in=4000
max_batches = 10000
policy=steps
steps=8000,9000
scales=.1,.1

[convolutional]
filters=8
size=3
pad=1
stride=2
batch_normalize=1
activation=leaky


[convolutional]
filters=8
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=8
filters=8
size=3
stride=2
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=4
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[convolutional]
filters=8
size=3
stride=2
pad=1
batch_normalize=1
activation=leaky


[convolutional]
filters=48
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=48
filters=48
size=3
pad=1
stride=1
batch_normalize=1
activation=leaky

[convolutional]
filters=16
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[route]
layers=-1,-4


[convolutional]
filters=64
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=64
filters=64
size=3
pad=1
stride=2
batch_normalize=1
activation=leaky

[convolutional]
filters=24
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[convolutional]
filters=96
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=96
filters=96
size=3
pad=1
stride=1
batch_normalize=1
activation=leaky

[convolutional]
filters=24
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[dropout]
probability=.15

[shortcut]
from=-5
activation=linear

[convolutional]
filters=96
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=96
filters=96
size=3
pad=1
stride=1
batch_normalize=1
activation=leaky

[convolutional]
filters=24
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[dropout]
probability=.15

[shortcut]
from=-5
activation=linear

[convolutional]
filters=96
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=96
filters=96
size=3
pad=1
stride=1
batch_normalize=1
activation=leaky

[convolutional]
filters=24
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[dropout]
probability=.15

[shortcut]
from=-5
activation=linear

[route]
layers=-1,10

[convolutional]
filters=128
size=1
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
groups=128
filters=128
size=3
stride=2
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=64
size=1
stride=1
pad=1
batch_normalize=1
activation=linear

[convolutional]
filters=256
size=1
stride=1
pad=1
batch_normalize=1
activation=linear


[convolutional]
filters=35
size=1
stride=1
pad=1
activation=linear

[yolo]
mask = 0, 1, 2, 3, 4
anchors =  12, 21,  20, 34,  32, 54,  52, 83,  95,140
classes=2
num=5
jitter=.3
ignore_thresh = .5
truth_thresh = 1
random=0
scale_x_y = 1.0
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6